FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл зависимостей первым — это нужно для кэширования слоев Docker.
# Если ты меняешь только код, а не requirements, сборка будет быстрее.
#COPY requirements.txt .

# Устанавливаем зависимости. --no-cache-dir экономит место в образе.
#RUN pip install --no-cache-dir -r requirements.txt

# Копируем весь остальной код проекта в контейнер.
# В compose мы дополнительно пробросим volume, чтобы править код на хосте без пересборки.
COPY . .

# (Опционально) Открываем порт, чтобы было понятнее, что приложение слушает 8000.
# Это не обязательно для работы, так как порт пробрасывается в docker-compose.


# Команда запуска. Она дублирует поле command в docker-compose.yml.
# Если в compose поле command есть — оно перекроет эту строку.
CMD ["python", "main.py"]
